data/Parm_PH_29/alpha_05/alpha_05_10071_2024/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
15600
(
(0.0460106565101097 0.998816232152446 7.33263928732293e-18)
(0.132920257573707 0.9755810887613 1.06114891882612e-17)
(0.203228240093845 0.918725728352859 4.64796255561689e-17)
(0.257854755675657 0.844852822876588 1.4791302509567e-17)
(0.306261849904099 0.766782728552919 7.54913355875525e-18)
(0.352988940826617 0.687718729757728 4.29767305148405e-18)
(0.400299476340993 0.608975122162997 7.29158684933865e-18)
(0.448832864922957 0.530913311842971 6.34500881658595e-18)
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.0459499823804353 0.998033129807464 0)
(0.132237422018293 0.975110619048878 0)
(0.202209142990215 0.918973710048538 0)
(0.256898321657016 0.845127661544943 0)
(0.305385526537934 0.766784169598056 0)
(0.35215620181092 0.687374297880345 0)
(0.399479766651235 0.608299610031202 0)
(0.448006689658627 0.529958007681489 0)
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.0419625 2.024 0)
(0.1258875 2.024 0)
(0.2098125 2.024 0)
(0.2937375 2.024 0)
(0.3776625 2.024 0)
(0.4615875 2.024 0)
(0.5455125 2.024 0)
(0.6294375 2.024 0)
...
)
;
    }
    inlet_half0
    {
        type            cyclic;
    }
    inlet_half1
    {
        type            cyclic;
    }
    outlet_half0
    {
        type            cyclic;
    }
    outlet_half1
    {
        type            cyclic;
    }
    sideRight_half0
    {
        type            empty;
    }
    sideRight_half1
    {
        type            empty;
    }
    sideLeft_half0
    {
        type            empty;
    }
    sideLeft_half1
    {
        type            empty;
    }
}


// ************************************************************************* //
