data/Parm_PH_29/alpha_05/alpha_05_10071_2024/0/tauij_LES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      tauij_LES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor>
15600
(
(0.00850307 -0.00022362 0.00000000 -0.00004727 0.00000000 0.00686756)
(-0.00027362 0.00011638 0.00000000 -0.00004996 0.00000000 -0.00058251)
(0.00001576 -0.00007653 0.00000000 0.00018149 0.00000000 0.00030302)
(0.00021146 -0.00018709 0.00000000 0.00012878 0.00000000 0.00174610)
(0.00008443 -0.00014719 0.00000000 0.00026474 0.00000000 0.00120420)
(0.00021185 -0.00031937 0.00000000 0.00049853 0.00000000 0.00207887)
(0.00000673 -0.00010096 0.00000000 0.00037423 0.00000000 0.00217487)
(0.00003005 0.00005355 0.00000000 -0.00019838 0.00000000 0.00029720)
...
)
;

boundaryField
{
    bottomWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    topWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    inlet_half0
    {
        type        cyclic;
    }
    inlet_half1
    {
        type        cyclic;
    }
    outlet_half0
    {
        type        cyclic;
    }
    outlet_half1
    {
        type        cyclic;
    }
    sideRight_half0
    {
        type        empty;
    }
    sideRight_half1
    {
        type        empty;
    }
    sideLeft_half0
    {
        type        empty;
    }
    sideLeft_half1
    {
        type        empty;
    }
}

// ************************************************************************* //
